docs/project/working.md
``` mermaid
sequenceDiagram
    participant Client as Client
    participant Endpoint as Endpoint
    participant "Task Queue" as TaskQueue
    participant Worker as Worker

    Client ->> Endpoint: ProblemRequest
    activate Endpoint
    Endpoint ->> TaskQueue: ProblemRequest
    activate TaskQueue
    TaskQueue ->> Endpoint: task_id
    deactivate TaskQueue
    Endpoint -->> Client: task_id
    deactivate Endpoint

    Client ->> Endpoint: task_id
    activate Endpoint
    Endpoint ->> TaskQueue: task_id
    activate TaskQueue
    TaskQueue -->> Endpoint: Status: PENDING
    deactivate TaskQueue
    Endpoint -->> Client: Status: PENDING

    Client ->> Endpoint: task_id
    activate Endpoint
    Endpoint ->> TaskQueue: task_id
    activate TaskQueue
    TaskQueue ->> Worker: ProblemRequest
    activate Worker
    Worker -->> TaskQueue: ProblemResponse
    deactivate Worker
    deactivate TaskQueue

    Client ->> Endpoint: task_id
    activate Endpoint
    Endpoint ->> TaskQueue: task_id
    activate TaskQueue
    TaskQueue -->> Endpoint: Status: FINISHED\nProblemResponse
    deactivate TaskQueue
    Endpoint -->> Client: Status: FINISHED\nProblemResponse
    deactivate Endpoint
    TaskQueue -->> TaskQueue: Delete task

```
